[
  {
    "image_link": "/static/images/visual_programming_01_scaled.png",
    "more_link": "/feature_visual_programming/",
    "video_link_tag": "HXjnDIgGDuI",
    "description": "Interactive data exploration for rapid qualitative analysis with clean visualizations. Graphic user interface allows you to focus on exploratory data analysis instead of coding, while clever defaults make fast prototyping of a data analysis workflow extremely easy. Place widgets on the canvas, connect them, load your datasets and harvest the insight!",
    "title": "Visual Programming"
  },
  {
    "image_link": "/static/images/interactive_data_vis_01_scaled.png",
    "more_link": "/feature_interactive_data_visualization/",
    "video_link_tag": "HXjnDIgGDuI",
    "description": "Perform simple data analysis with clever data visualization. Explore statistical distributions, box plots and scatter plots, or dive deeper with decision trees, hierarchical clustering, heatmaps, MDS and linear projections. Even your multidimensional data can become sensible in 2D, especially with clever attribute ranking and selections.",
    "title": "Interactive Data Visualization"
  },
  {
    "image_link": "/static/images/iadv_data_mining_02_scaled.png",
    "more_link": "/feature_advanced_data_mining_machine_learning/",
    "video_link_tag": "HXjnDIgGDuI",
    "description": "Orange features an extensive scripting library of standard  supervised and unsupervised machine learning algorithms, such as linear and logistic regression, classification trees, random forests, naive bayes and k-means clustering for outlier detection, seamless predictive model construction, evaluation, and forecasting. Integration with SQL provides easy access to large databases, while numerous add-ons extend the core distribution with specialized widgets.",
    "title": "Advanced Data Mining and Machine Learning Features"
  },
  {
    "image_link": "/static/images/iadv_data_mining_02_scaled.png",
    "more_link": "/feature_applications_orange/",
    "video_link_tag": "HXjnDIgGDuI",
    "description": "Orange can be used for a broad variety of tasks. Its intuitive interface makes it a great business intelligence tool for market forecasting, risk assessment and process optimization. It is frequently used in science for predictive analytics and bioinformatics research. And due to its intelligible visualizations, it is also a wonderful tool for teaching data mining techniques.",
    "title": "Wide Applicability"
  },
  {
    "image_link": "/static/images/add_ons_scaled.png",
    "more_link": "/feature_addons_extend_functionality/",
    "video_link_tag": "HXjnDIgGDuI",
    "description": "Use various add-ons available within Orange to mine data from external data sources, perform natural language processing and text mining, conduct network analysis, infer frequent itemset and do association rules mining. Additionally, bioinformaticians and molecular biologists can use Orange to rank genes by their differential expression and perform enrichment analysis.",
    "title": "Add-ons Extend Functionality"
  }
]