[
  {
    "title": "Interactive Data Visualization",
    "image_link": "/static/images/interactive_data_vis_01_scaled.png",
    "more_link": "/features/interactive-data-visualization/",
    "description": "Perform simple data analysis with clever data visualization. Explore statistical distributions, box plots and scatter plots, or dive deeper with decision trees, hierarchical clustering, heatmaps, MDS and linear projections. Even your multidimensional data can become sensible in 2D, especially with clever attribute ranking and selections."
  },
  {
    "title": "Visual Programming",
    "image_link": "/static/images/visual_programming_01_scaled.png",
    "more_link": "/features/visual-programming/",
    "video_link_tag": "lb-x36xqJ-E?start=6",
    "description": "Interactive data exploration for rapid qualitative analysis with clean visualizations. Graphic user interface allows you to focus on exploratory data analysis instead of coding, while clever defaults make fast prototyping of a data analysis workflow extremely easy. Place widgets on the canvas, connect them, load your datasets and harvest the insight!"
  },
  {
    "title": "Teachers and Students Love It",
    "image_link": "/static/images/iadv_data_mining_02_scaled.png",
    "description": "When teaching data mining, we like to illustrate rather than only explain. And Orange is great at that. Used at schools, universities and in professional training courses across the world, Orange supports hands-on training and visual illustrations of concepts from data science. There are even widgets that were especially designed for teaching."
  },
  {
    "title": "Add-ons Extend Functionality",
    "image_link": "/static/images/add_ons_scaled.png",
    "video_link_tag": "OANsA6fMJKg?start=6",
    "description": "Use various add-ons available within Orange to mine data from external data sources, perform natural language processing and text mining, conduct network analysis, infer frequent itemset and do association rules mining. Additionally, bioinformaticians and molecular biologists can use Orange to rank genes by their differential expression and perform enrichment analysis."
  }
]
